// Типы данных

// JS - динамически типизированный язык. Тип переменной определяется в момент выполнения, а не при объявлении.

// number - Числа с плавающей точкой. Целых чисел как отдельного типа нет.

let x = 42;
const pi = 3.14;
let inf = Infinity;

// bigint - целые числа произвольной длины. Нельзя смешивать с number

let big = 626371623761873687672163616361263786123762362873678263631638726872167862167326676213999n;

// string - строки. Можно использовать ' , " или шаблонные литералы `

let name = "Сергей";
let info = `Привет, ${name}`;

// boolean - логический тип 

let b = true;

// null - явное отсутствие значения. Присваивается вручную.

let user = null;
let user_2;

// symbol - уникальный и неизменяемый идентификатор. Полезен для ключей объектов.

let id = Symbol("id");

let id_2 = Symbol("id2");

// object - все остальное - объекты {}, массивы[], функции, Map, Set

let user_info = {name: "Сергей", age: 20};
let arr = [1,2,3,4,5];

// Преобразование типов
Number("jhjhkjhj");
console.log(String(334343454));





















